app/services/anomaly_detection_service.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."amount" = 12.5 AND "transactions"."transaction_date" = '2025-08-19' AND "transactions"."id" != 1
SELECT 1 AS one FROM "transactions" WHERE "transactions"."duplicate_hash" = '64d78808947d5ced4dcd89dee0f1628f6016fff66e0b28ae8c2606cc247d3b2a' AND "transactions"."id" != 1 LIMIT 1
---
  def detect_potential_duplicates
    # Check for transactions with same amount, date, and similar description
    similar_transactions = Transaction.where(
      amount: @transaction.amount,
      transaction_date: @transaction.transaction_date
    ).where.not(id: @transaction.id)

    similar_transactions.each do |similar|
      similarity = calculate_description_similarity(@transaction.description, similar.description)

      if similarity > 0.8 # 80% similarity threshold
        @anomalies << {
          type: "potential_duplicate",
          severity: 3,
          description: "Potential duplicate of transaction ##{similar.id} with #{(similarity * 100).round}% similarity"
        }
      end
    end

    # Check for exact duplicates by hash
    if Transaction.where(duplicate_hash: @transaction.duplicate_hash).where.not(id: @transaction.id).exists?

SELECT "transactions"."amount" FROM "transactions" WHERE (transaction_date >= '2025-05-22 18:51:04.732231' AND id != 1)
---
  def calculate_historical_stats
    # Get last 90 days of transactions (excluding current one)
    historical = Transaction.where(
      "transaction_date >= ? AND id != ?",
      90.days.ago,
      @transaction.id || 0
    )

    amounts = historical.pluck(:amount).map(&:to_f)

INSERT INTO "anomaly_detections" ("transaction_record_id", "anomaly_type", "severity", "description", "resolved", "created_at", "updated_at") VALUES (1, 'incomplete_metadata', 2, 'Incomplete transaction data: Missing category', FALSE, '2025-08-20 18:59:38.235732', '2025-08-20 18:59:38.235732') RETURNING "id"
---
  def create_anomaly_records
    @anomalies.each do |anomaly_data|
      AnomalyDetection.create!(
        transaction_record: @transaction,
        anomaly_type: anomaly_data[:type],
        severity: anomaly_data[:severity],
        description: anomaly_data[:description],
        resolved: false
      )