app/controllers/api/v1/anomaly_detections_controller.rb

  def index
    # Build query with eager loading
    @anomaly_detections = AnomalyDetection.includes(transaction_record: :category)

    # Apply filters efficiently
    @anomaly_detections = @anomaly_detections.where(resolved: false) if params[:unresolved] == 'true'
    @anomaly_detections = @anomaly_detections.by_severity(params[:severity]) if params[:severity].present?
    @anomaly_detections = @anomaly_detections.by_type(params[:anomaly_type]) if params[:anomaly_type].present?

    # Order by priority (severity desc, then creation time)
    @anomaly_detections = @anomaly_detections.order(severity: :desc, created_at: :desc)

    # Get current page and per_page params
    page = params[:page]&.to_i || 1
    per_page = [(params[:per_page]&.to_i || 50), 100].min

    # Use Kaminari for pagination
    paginated_anomalies = @anomaly_detections.page(page).per(per_page)
---
SELECT "anomaly_detections".* FROM "anomaly_detections" WHERE "anomaly_detections"."transaction_record_id" IN (10, 1, 2, 3, 4, 5, 7, 6, 8, 9)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 3, 7)
SELECT "anomaly_detections".* FROM "anomaly_detections" WHERE "anomaly_detections"."transaction_record_id" = 10 AND "anomaly_detections"."resolved" = FALSE
SELECT 1 AS one FROM "anomaly_detections" WHERE "anomaly_detections"."transaction_record_id" = 10 AND "anomaly_detections"."resolved" = FALSE LIMIT 1
SELECT "anomaly_detections".* FROM "anomaly_detections" WHERE "anomaly_detections"."resolved" = FALSE ORDER BY "anomaly_detections"."severity" DESC, "anomaly_detections"."created_at" DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "anomaly_detections"