app/controllers/api/v1/categories_controller.rb

  def index
    @categories = Category.all.includes(:transactions)

    render json: {
      categories: @categories.map { |c| category_json(c) }
---
SELECT "categories".* FROM "categories"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."category_id" IN (1, 2, 3, 4, 5, 6, 7)