app/controllers/api/v1/rules_controller.rb

  def index
    @rules = Rule.all.order(created_at: :desc)
---
SELECT "rules".* FROM "rules" ORDER BY "rules"."created_at" DESC