app/controllers/api/v1/transactions_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 3, 7)
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" IN (10, 9, 8, 7)
SELECT COUNT(*) FROM "anomaly_detections"
SELECT COUNT(*) FROM "transactions"
SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."transaction_date" DESC, "transactions"."created_at" DESC LIMIT 50 OFFSET 0
---
  def index
    # Build base query with eager loading to prevent N+1 queries
    @transactions = Transaction.includes(:category, :anomaly_detections)

    # Apply filters efficiently using indexed columns
    @transactions = apply_filters(@transactions)

    # Apply sorting for consistent pagination
    @transactions = @transactions.order(transaction_date: :desc, created_at: :desc)

    # Get current page and per_page params
    page = params[:page]&.to_i || 1
    per_page = [(params[:per_page]&.to_i || 50), 100].min

    # Use Kaminari for pagination
    paginated_transactions = @transactions.page(page).per(per_page)

    # Get total count manually to ensure accuracy
    total_count = @transactions.except(:limit, :offset, :order).count