app/models/rule.rb

  def apply_to!(transaction)
    return unless applies_to?(transaction)

    case action_type
    when 'categorize'
      category = Category.find_or_create_by(name: action_value)
      transaction.update!(category: category)
    when 'flag'
      transaction.update!(status: :flagged)
      AnomalyDetection.create!(
        transaction_record: transaction,
        anomaly_type: 'rule_based',
        severity: 2,
        description: "Flagged by rule: #{name}",
        resolved: false
      )
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Transportation' LIMIT 1
UPDATE "transactions" SET "category_id" = 2, "updated_at" = '2025-08-20 18:51:42.041082' WHERE "transactions"."id" = 3
UPDATE "transactions" SET "status" = 2, "updated_at" = '2025-08-20 18:51:42.066183' WHERE "transactions"."id" = 5
INSERT INTO "anomaly_detections" ("transaction_record_id", "anomaly_type", "severity", "description", "resolved", "created_at", "updated_at") VALUES (5, 'rule_based', 2, 'Flagged by rule: Flag large transactions', FALSE, '2025-08-20 18:59:38.299460', '2025-08-20 18:59:38.299460') RETURNING "id"